00_Casos/03_Gmsh-OpenFOAM/canal_laminar/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    frontAndBack
    {
        type            empty;
        physicalType    patch;
        nFaces          363948;
        startFace       272574;
    }
    simetry
    {
        type            symmetry;
        physicalType    patch;
        nFaces          120;
        startFace       636522;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       636642;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       636672;
    }
    walls
    {
        type            patch;
        physicalType    patch;
        nFaces          594;
        startFace       636702;
    }
)

// ************************************************************************* //
